ebill_paynet/tests/fixtures/cassettes/test_ping_service.yaml

interactions:
- request:
    body: '<?xml version=''1.0'' encoding=''utf-8''?>

      <soap-env:Envelope xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/"><soap-env:Body><ns0:PingMsg
      xmlns:ns0="http://www.sap.com/DXPPTypes"/></soap-env:Body></soap-env:Envelope>'
    headers:
      Accept:
      - '*/*'
      Accept-Encoding:
      - gzip, deflate
      Connection:
      - keep-alive
      Content-Length:
      - '223'
      Content-Type:
      - text/xml; charset=utf-8
      SOAPAction:
      - '"urn:#ping"'
      User-Agent:
      - Zeep/3.3.1 (www.python-zeep.org)
    method: POST
    uri: https://dws-test.paynet.ch/DWS/DWS
  response:
    body:
      string: <env:Envelope xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
        xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
        xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"><env:Body><dxpp:PingMsgReply
        xmlns:dxpp="http://www.sap.com/DXPPTypes"><dxpp:State>OK</dxpp:State><dxpp:Timestamp>2019-06-04T09:08:19.232Z</dxpp:Timestamp><dxpp:Version>Not
        defined</dxpp:Version></dxpp:PingMsgReply></env:Body></env:Envelope>
    headers:
      Connection:
      - close
      Content-Type:
      - text/xml;charset=UTF-8
      Date:
      - Tue, 04 Jun 2019 09:08:19 GMT
      Server:
      - Apache
      Set-Cookie:
      - JSESSIONID=DF3F45FC6896B69CC213C431EF8928C8;HttpOnly;Secure
      Vary:
      - Accept-Encoding,User-Agent
      content-length:
      - '467'
    status:
      code: 200
      message: OK
version: 1
